-- phpMyAdmin SQL Dump
-- version 4.7.4
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Aug 01, 2018 at 06:02 PM
-- Server version: 10.1.28-MariaDB
-- PHP Version: 7.1.11

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `banglaacademy`
--

-- --------------------------------------------------------

--
-- Table structure for table `admin_info`
--

CREATE TABLE `admin_info` (
  `id` int(11) NOT NULL,
  `User_Name` varchar(120) NOT NULL,
  `Email` varchar(150) NOT NULL,
  `Password` varchar(150) NOT NULL,
  `Address` text NOT NULL,
  `Image` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `admin_info`
--

INSERT INTO `admin_info` (`id`, `User_Name`, `Email`, `Password`, `Address`, `Image`) VALUES
(1, 'Rashedul Hasan Likhon', 'rhklikhon@gmail.com', '654321', 'Comilla university', '5b5b64c66ab5dLikhon.jpg'),
(2, 'Mithalesh Kumar Mukhiya', 'mithalesh@gmail.com', '54321', 'Comilla University, Comilla', '5b61ccdf43d31lucky.jpg');

-- --------------------------------------------------------

--
-- Table structure for table `answers`
--

CREATE TABLE `answers` (
  `id` int(11) NOT NULL,
  `reply` text CHARACTER SET utf8 NOT NULL,
  `time` varchar(255) CHARACTER SET utf8 NOT NULL,
  `question_id` varchar(200) NOT NULL,
  `user_id` varchar(200) NOT NULL,
  `update_label` varchar(150) NOT NULL,
  `update_time` varchar(255) CHARACTER SET utf8 DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `answers`
--

INSERT INTO `answers` (`id`, `reply`, `time`, `question_id`, `user_id`, `update_label`, `update_time`) VALUES
(20, '<!DOCTYPE html>\r\n<html>\r\n<head>\r\n</head>\r\n<body>\r\n<p style=\"text-align: justify; background: lightgray; padding: 10px;\">পিএইচপিতে কাজ করার জন্য কি কি সফটওয়ার প্রয়োজন পিএইচপিতে কাজ করার জন্য কি কি সফটওয়ার প্রয়োজন পিএইচপিতে কাজ করার জন্য কি কি সফটওয়ার প্রয়োজন পিএইচপিতে কাজ করার জন্য কি কি সফটওয়ার প্রয়োজন পিএইচপিতে কাজ করার জন্য কি কি সফটওয়ার প্রয়োজন পিএইচপিতে কাজ করার জন্য কি কি সফটওয়ার প্রয়োজন পিএইচপিতে কাজ করার জন্য কি কি সফটওয়ার প্রয়োজন পিএইচপিতে কাজ করার জন্য কি কি সফটওয়ার প্রয়োজন পিএইচপিতে কাজ করার জন্য কি কি সফটওয়ার প্রয়োজন পিএইচপিতে কাজ করার জন্য কি কি সফটওয়ার প্রয়োজন পিএইচপিতে কাজ করার জন্য কি কি সফটওয়ার প্রয়োজন পিএইচপিতে কাজ করার জন্য কি কি সফটওয়ার প্রয়োজন পিএইচপিতে কাজ করার জন্য কি কি সফটওয়ার প্রয়োজন পিএইচপিতে কাজ করার জন্য কি কি সফটওয়ার প্রয়োজন পিএইচপিতে কাজ করার জন্য কি কি সফটওয়ার প্রয়োজন পিএইচপিতে কাজ করার জন্য কি কি সফটওয়ার প্রয়োজন&nbsp;</p>\r\n<blockquote>\r\n<p style=\"text-align: justify;\"><span style=\"font-size: 10pt;\">পিএইচপিতে কাজ করার জন্য কি কি সফটওয়ার প্রয়োজন পিএইচপিতে কাজ করার জন্য কি কি সফটওয়ার প্রয়োজন পিএইচপিতে কাজ করার জন্য কি কি সফটওয়ার প্রয়োজন পিএইচপিতে কাজ করার জন্য কি কি সফটওয়ার প্রয়োজন পিএইচপিতে কাজ করার জন্য কি কি সফটওয়ার প্রয়োজন পিএইচপিতে কাজ করার জন্য কি কি সফটওয়ার প্রয়োজন পিএইচপিতে কাজ করার জন্য কি কি সফটওয়ার প্রয়োজন পিএইচপিতে কাজ করার জন্য কি কি সফটওয়ার প্রয়োজন পিএইচপিতে কাজ করার জন্য কি কি সফটওয়ার প্রয়োজন পিএইচপিতে কাজ করার জন্য কি কি সফটওয়ার প্রয়োজন পিএইচপিতে কাজ করার জন্য কি কি সফটওয়ার প্রয়োজন পিএইচপিতে কাজ করার জন্য কি কি সফটওয়ার প্রয়োজন পিএইচপিতে কাজ করার জন্য কি কি সফটওয়ার প্রয়োজন পিএইচপিতে কাজ করার জন্য কি কি সফটওয়ার প্রয়োজন পিএইচপিতে কাজ করার জন্য কি কি সফটওয়ার প্রয়োজন পিএইচপিতে কাজ করার জন্য কি কি সফটওয়ার প্রয়োজন&nbsp;</span></p>\r\n<p style=\"text-align: justify;\"><span style=\"font-size: 10pt;\">hjj</span></p>\r\n</blockquote>\r\n</body>\r\n</html>', '২৪-০১-২০১৮ ২:২৫ দুপুর', '48 ', '15', '1', '২৪-০১-২০১৮ ৩:১৫ দুপুর'),
(21, '<!DOCTYPE html>\r\n<html>\r\n<head>\r\n</head>\r\n<body>\r\n<p style=\"text-align: justify; background: lightgray; padding: 10px;\">সিপ্যানেলের পাসওয়ার্ড পরিবর্তন করা সাইটের জন্য অনেক প্রয়োজনীয় একটি বিষয় কেননা এটি আপনার সাইট সিকিউরিটি নিয়ে কথা। নতুন ডোমেইন হোস্টিং নিলে ডিফল্ট পাসওয়ার্ড দেওয়া থাকে, তাই সিপ্যানেলের পাসওয়ার্ড পরিবর্তন করে নেওয়া অনেক দরকারি একটি কাজ। এর জন্য প্রথমেই আপনার সিপ্যানেলে লগিন করুন।</p>\r\n<blockquote>\r\n<p style=\"text-align: justify;\">লগিন করা হয়ে গেলে প্রেফারেন্স ট্যাব থেকে Change Password বাটনে ক্লিক করুন, তাহলে নিচের মত একটি পেজ দেখতে পাবেন।</p>\r\n<img src=\"uploads/cPanel.png\" width=\"100%\" height=\"450\" />\r\n<p>এবার আপনার পুরাতন পাসওয়ার্ড লিখে নতুন পাসওয়ার্ডটি দুবার লিখে Change your password now! বাটনে ক্লিক করুন, তাহলে আপনার সাইটের লগিন পাসওয়ার্ড তথা সিপ্যানেল পাসওয়ার্ড পরিবর্তন হয়ে যাবে। এইক্ষেত্রে কঠিন পাসওয়ার্ড দেওয়া যেতে পারে</p>\r\n</blockquote>\r\n</body>\r\n</html>', '২৪-০১-২০১৮ ৮:৪৪ দুপুর', '40 ', '17', '1', '০১-০৮-২০১৮ ৫:৪৬ দুপুর'),
(22, '<!DOCTYPE html>\r\n<html>\r\n<head>\r\n</head>\r\n<body>\r\n<p style=\"text-align: justify; font-size: 15px;background: lightyellow; padding: 10px;border-left:2px solid orange;\">সি-প্যানেলের পাসওয়ার্ড পরির্বতনের জন্য প্রথমে ডোমেইন নেম লিখতে হবে তারপর স্ল্যাশ(/)দিয়ে cpanel লিখতে হবে। তারপর লগ পেজ আসবে। হোস্টিং ইউজার নেইম এবং পাসওয়ার্ড দিয়ে আপনি আপনার হোস্টিং সি-প্যানেলে লগইন করুন। লগইন হয়ে গেলে সি-প্যানেলের টপ বার মেনু থেকে Down Arrow Button ক্লিক করব। এখান থেকে Password &amp; Security Button এ ক্লিক করব।</p>\r\n<blockquote style=\"text-align: justify; font-size: 15px;\">অথবা নিচে Preference নামে একটি অপশন দেখতে পারব। এখান থেকে Password &amp; Security Button এ ক্লিক করব। পাসওয়ার্ড অপশনে গিয়ে বর্তমানে যে পাসওয়ার্ড দিয়ে লগইন করা হয়েছে সেই পাসওয়ার্ডটি দিব। নিউ পাসওয়ার্ড এর জন্য সি-প্যানেলের পাসওয়ার্ড জেনারেট অপশন ব্যবহার করব। এজন্য পাসওয়ার্ড জেনারেটর এই button এ ক্লিক করব। জেনারেট হওয়া পাসওয়ার্ডটি কোথাও সেভ করে রাখব। এরপর নিচে ইউজ পাসওয়ার্ড button এ ক্লিক করব। এরপর Change your password now এই button এ ক্লিক করব। পাসওয়ার্ড Successful Reset হয়ে গেলে আপনার সি-প্যানেলে অটোমেটিক Log out হয়ে যাবে। এভাবে আমরা হোস্টিং সিপ্যানেলের পাসওয়ার্ড Change করতে পারি।</blockquote>\r\n</body>\r\n</html>', '২৪-০১-২০১৮ ৮:৫০ দুপুর', '40 ', '16', '1', '২৪-০৬-২০১৮ ৪:৩৩ দুপুর'),
(23, '<!DOCTYPE html>\r\n<html>\r\n<head>\r\n</head>\r\n<body>\r\n<p style=\"text-align: justify; padding: 15px; background: lightgray;\">ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায় ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায়</p>\r\n<blockquote>\r\n<p style=\"text-align: justify;\">ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায় ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায় ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায়</p>\r\n</blockquote>\r\n</body>\r\n</html>', '১৪-০২-২০১৮ ৮:৪১ দুপুর', '53 ', '15', '0', 'Null'),
(24, '<!DOCTYPE html>\r\n<html>\r\n<head>\r\n</head>\r\n<body>\r\n<blockquote>\r\n<p><em><u>ইনলাইন ফাংশনঃ</u></em> যদি কোন মেম্বার ফাংশন এর ডেফিনেশন ক্লাসের এর মধ্যে লেখা হয় তখন তাকে ইনলাইন মেম্বার ফাংশন বা inline member function বলে&hellip; অর্থাৎ ইনলাইন মেম্বার ফাংশন এর ক্ষেত্রে স্কোপ রেজুলুশোন অপারেটর ব্যবহার করা হবে না&hellip;</p>\r\n</blockquote>\r\n<p><em><u>ইনলাইন মেম্বার ফাংশন এর সুবিধা এবং অসুবিধাঃ </u></em> ক্লাসের ইনলাইন মেম্বার ফাংশন এর ক্ষেত্রে যখন কোন অবজেক্ট ঘোষনা করা হয় তখন প্রতিটি অবজেক্ট এর জন্যেই মেম্বার ফাংশন এর একটি করে কপি তৈরী হয়। ফলে প্রোগ্রাম রান হবার সময় জাম্প ইন্সট্রাকশন এর জন্য যে সময় লাগে তা বেচে যায়। ফলে প্রোগ্রাম দ্রুত রান করে। কিন্তু অসুবিধা হচ্ছে যে প্রতিটি অবজেক্ট এর জন্য ইনলাইন মেম্বার ফাংশন এর একটি করে কপি তৈরী হবার ফলে মেমরি এর অপচয় হয়। অর্থাৎ এক্ষেত্রে মেমোরী বেশী লাগে।</p>\r\n<p>আচ্ছা ব্যাপারটা আরেকটু পরিষ্কার করে দেয় ।</p>\r\n<p>ধরা যাক আমাদের একটি প্রোগ্রামে ৫০০ অবজেক্ট এর প্রয়োজন। এই ৫০০ অবজেক্ট একটি ফাংশন কে এক্সেস করবে অর্থাৎ ৫০০ টি অবজেক্ট ই একটি ফাংশন নিয়ে ৫০০ বার কাজ করবে।</p>\r\n<p>এক্ষত্রে যদি ফাংশনটিকে ইনলাইন মেম্বার ফাংশন বা ক্লাসের ভিতরে এর ডেফিনেশন লেখা হয় তাহলে প্রতিটি অবজেক্টের সাথে এর একটি করে কপি তৈরী হবে ফলে ৫০০ অবজেক্ট এর জন্য এর মেমোরীতে ৫০০ টি অবজেক্ট তৈরী হবে ফলে মেমোরী তে জায়গা বেশী নিবে। কিন্তু প্রোগ্রামটি দ্রুত রান করবে।</p>\r\n<p>আবার যদি এর ডেফিনেশন ক্লাসের বাইরে ∷ বা scope resolution operator ব্যবহার করে লেখা হয় তাহলে ৫০০ টি অবজেক্ট এর জন্য এর শুধু মাত্র একটিই কপি তৈরী হবে। আর ৫০০ টি অবজেক্ট ই এই একটি কপি কেই ব্যবহার করবে। যার ফলে মেমরী তে জায়গা নিবে কম কিন্তু কাজ করবে ধীর গতিতে। কারন একটি কপিকে ৫০০ জনে ব্যবহার করলে ধীর তো হবেই&hellip; নাকি?</p>\r\n</body>\r\n</html>', '২৪-০৬-২০১৮ ৩:৫২ দুপুর', '52 ', '14', '0', 'Null'),
(25, '<!DOCTYPE html>\r\n<html>\r\n<head>\r\n</head>\r\n<body>\r\n<p style=\"text-align: justify; font-size: 15px; background: lightgray; padding: 10px;\">প্রথমে হোস্টিং সিপ্যানেলে প্রবেশ করতে হবে। হোস্টিং সি-প্যানেলে প্রবেশ করার জন্য আপনার ডোমেইন নেইমের এর পরে একটি স্ল্যাশ (/) দিয়ে লিখতে হবে সি-প্যানেল। হোস্টিং ইউজার নেইম এবং পাসওয়ার্ড দিয়ে আপনি আপনার হোস্টিং সি-প্যানেলে লগইন করুন। লগইন হয়ে গেলে সি-প্যানেলের টপ বার মেনু থেকে Down Arrow Button ক্লিক করব। এখান থেকে Password &amp; Security Button এ ক্লিক করব।</p>\r\n<blockquote style=\"text-align: justify; font-size: 15px;\">অথবা নিচে Preference নামে একটি অপশন দেখতে পারব। এখান থেকে Password &amp; Security Button এ ক্লিক করব। পাসওয়ার্ড অপশনে গিয়ে বর্তমানে যে পাসওয়ার্ড দিয়ে লগইন করা হয়েছে সেই পাসওয়ার্ডটি দিব। নিউ পাসওয়ার্ড এর জন্য সি-প্যানেলের পাসওয়ার্ড জেনারেট অপশন ব্যবহার করব। এজন্য পাসওয়ার্ড জেনারেটর এই button এ ক্লিক করব। জেনারেট হওয়া পাসওয়ার্ডটি কোথাও সেভ করে রাখব। এরপর নিচে ইউজ পাসওয়ার্ড button এ ক্লিক করব। এরপর Change your password now এই button এ ক্লিক করব। পাসওয়ার্ড Successful Reset হয়ে গেলে আপনার সি-প্যানেলে অটোমেটিক Log out হয়ে যাবে। এভাবে আমরা হোস্টিং সিপ্যানেলের পাসওয়ার্ড Change করতে পারি।</blockquote>\r\n</body>\r\n</html>', '২৪-০৬-২০১৮ ৪:৪৭ দুপুর', '40', '15', '1', '২৪-০৬-২০১৮ ৪:৪৮ দুপুর');

-- --------------------------------------------------------

--
-- Table structure for table `copyright_text`
--

CREATE TABLE `copyright_text` (
  `id` int(11) NOT NULL,
  `note` varchar(255) CHARACTER SET utf8 NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `copyright_text`
--

INSERT INTO `copyright_text` (`id`, `note`) VALUES
(1, '2018, স্বত্ব বাংলা একাডেমী ');

-- --------------------------------------------------------

--
-- Table structure for table `higher_secondary_subjects`
--

CREATE TABLE `higher_secondary_subjects` (
  `id` int(11) NOT NULL,
  `division` varchar(200) NOT NULL,
  `subject` varchar(200) CHARACTER SET utf8 NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `higher_secondary_subjects`
--

INSERT INTO `higher_secondary_subjects` (`id`, `division`, `subject`) VALUES
(2, 'science', 'গনিত');

-- --------------------------------------------------------

--
-- Table structure for table `notification`
--

CREATE TABLE `notification` (
  `id` int(11) NOT NULL,
  `ques_title` varchar(255) CHARACTER SET utf8 NOT NULL,
  `user_id` varchar(255) NOT NULL,
  `value` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `notification`
--

INSERT INTO `notification` (`id`, `ques_title`, `user_id`, `value`) VALUES
(7, 'প্রোগ্রামিংয়ে অপারেটর ওভারলোডিং বলতে কি বুজায় ?', '13', '0');

-- --------------------------------------------------------

--
-- Table structure for table `questions`
--

CREATE TABLE `questions` (
  `id` int(11) NOT NULL,
  `Title` varchar(200) CHARACTER SET utf8 NOT NULL,
  `Tags` varchar(200) CHARACTER SET utf8 NOT NULL,
  `Content` text CHARACTER SET utf8 NOT NULL,
  `Time` varchar(200) CHARACTER SET utf8 NOT NULL,
  `User_Name` varchar(180) CHARACTER SET utf8 NOT NULL,
  `User_Id` varchar(50) NOT NULL,
  `views` int(255) NOT NULL DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `questions`
--

INSERT INTO `questions` (`id`, `Title`, `Tags`, `Content`, `Time`, `User_Name`, `User_Id`, `views`) VALUES
(1, 'জেকুয়েরি দিয়ে কিভাবে ফরম ভ্যালিডেশন করতে হয় ?', 'জেকুয়েরি ', '<!DOCTYPE html>\r\n<html>\r\n<head>\r\n</head>\r\n<body>\r\n<blockquote>\r\n<p>জেকুয়েরি দিয়ে কিভাবে ফরম ভ্যালিডেশন করতে হয় জেকুয়েরি দিয়ে কিভাবে ফরম ভ্যালিডেশন করতে হয়জেকুয়েরি দিয়ে কিভাবে ফরম ভ্যালিডেশন করতে হয়জেকুয়েরি দিয়ে কিভাবে ফরম ভ্যালিডেশন করতে হয়</p>\r\n<h3><span class=\"example1\">জেকুয়েরি দিয়ে কিভাবে ফরম ভ্যালিডেশন করতে হয়</span></h3>\r\n</blockquote>\r\n</body>\r\n</html>', '২০-০১-২০১৮ ২:৪৬ দুপুর', 'রাশিদুল হাসান', '13', 6),
(34, 'প্রোগ্রামিংয়ে প্রোটোটাইপিং বলতে কি বুজায় ?', 'সি জাভা', '<!DOCTYPE html>\r\n<html>\r\n<head>\r\n</head>\r\n<body>\r\n<blockquote><span class=\"example1 example2\"><span class=\"example1 example2\"><span class=\"example1 example2\">প্রোগ্রামিংয়ে প্রোটোটাইপিং বলতে কি বুজায় ?</span></span></span>\r\n<h6>প্রোগ্রামিংয়ে প্রোটোটাইপিং বলতে কি বুজায় ?</h6>\r\n<h6>প্রোগ্রামিংয়ে প্রোটোটাইপিং বলতে কি বুজায় ?</h6>\r\n<h6>প্রোগ্রামিংয়ে প্রোটোটাইপিং বলতে কি বুজায় ?</h6>\r\n<p>&nbsp;</p>\r\n</blockquote>\r\n</body>\r\n</html>', '২০-০১-২০১৮ ৩:০২ দুপুর', 'রাশিদুল হাসান', '13', 5),
(35, ' প্রোগ্রামিং ল্যাঙ্গুয়েজ কাকে বলে ?', 'জাভা', '<!DOCTYPE html>\r\n<html>\r\n<head>\r\n</head>\r\n<body>\r\n<blockquote>\r\n<p style=\"font-size: 16px; text-align: justify;\"><span class=\"example2\" style=\"color: #000000;\">কম্পিউটারের কথা বলি, কম্পিউটার অন করলেই হাজার হাজার ইন্সট্রাকশন কাজ করা শুরু করে। আমরা কম্পিউটার অন করে মিউজিক শুনি, মিউজিক প্লেয়ার একটা প্রোগ্রাম। যার মধ্যে রয়েছে অনেক গুলো ইন্সট্রাকশন। আমরা গেম খেলি। এক একটা গেম এক একটা প্রোগ্রাম। রয়েছে অনেক হাজার হাজার ইন্সট্রাকশন। আর এই ইন্সট্রাকশন গুলো লেখার কাজই কি প্রোগ্রামিং?</span>&lt;/&gt;</p>\r\n</blockquote>\r\n</body>\r\n</html>', '২০-০১-২০১৮ ৩:০৫ দুপুর', 'রাশিদুল হাসান', '13', 24),
(37, 'পিএইচপিতে কিভাবে একটা স্ট্রিংকে এ্যারেতে রুপান্তরিত করতে হয় ?', 'পিএইচপি জাভা', '<!DOCTYPE html>\r\n<html>\r\n<head>\r\n</head>\r\n<body>\r\n<blockquote>\r\n<p>পিএইচপিতে কিভাবে একটা স্ট্রিংকে এ্যারেতে রুপান্তরিত করতে হয়।পিএইচপিতে কিভাবে একটা স্ট্রিংকে এ্যারেতে রুপান্তরিত করতে হয়&nbsp;পিএইচপিতে কিভাবে একটা স্ট্রিংকে এ্যারেতে রুপান্তরিত করতে হয়&nbsp;পিএইচপিতে কিভাবে একটা স্ট্রিংকে এ্যারেতে রুপান্তরিত করতে হয়&nbsp;পিএইচপিতে কিভাবে একটা স্ট্রিংকে এ্যারেতে রুপান্তরিত করতে হয়&nbsp;পিএইচপিতে কিভাবে একটা স্ট্রিংকে এ্যারেতে রুপান্তরিত করতে হয়&nbsp;</p>\r\n</blockquote>\r\n</body>\r\n</html>', '২০-০১-২০১৮ ৩:৫৫ দুপুর', 'রিদয় খান', '14', 8),
(40, 'সি প্যনেল এর পাসওয়ার্ড কিভাবে পরিবর্তন করতে হয় ?', 'সি-প্যানেল', '<!DOCTYPE html>\r\n<html>\r\n<head>\r\n</head>\r\n<body>\r\n<p>সি-প্যানেলের পাসওয়ার্ড পরিবর্তন করা ওয়েবসাইটের জন্য একটি প্রয়োজনীয় বিষয়। কারণ এটি আপনার ওয়েবসাইটের Security এর সাথে জড়িত। নতুন হোস্টিং কেনার সময় Default পাসওয়ার্ড দেওয়া থাকে। নতুন অবস্থায় সি-প্যানেলের default পাসওয়ার্ড পরিবর্তন করে নেয়াটা খুবই গুরুত্বপূর্ণ। কিন্তু সি-প্যানেলের পাসওয়ার্ড কিভাবে পরিবর্তন করতে হয় তা আমার জানা নেই। তাই এ ব্যাপারে কেউ গাইডলাইন দিলে খুব উপকৃত হব।</p>\r\n<p>&nbsp;</p>\r\n</body>\r\n</html>', '২১-০১-২০১৮ ৩:২২ দুপুর', 'রাশিদুল হাসান', '13', 174),
(41, 'পিএইচপি মাইএডমিন এ কিভাবে ক্যারাকটার সেট করতে হয় ?', 'পিএইচপি জাভা সি', '<!DOCTYPE html>\r\n<html>\r\n<head>\r\n</head>\r\n<body>\r\n<p><span style=\"font-size: 10pt; background-color: #ccffcc;\">পিএইচপি মাইএডমিন এ কিভাবে ক্যারাকটার সেট করতে হয়পিএইচপি মাইএডমিন এ কিভাবে ক্যারাকটার সেট করতে হয়পিএইচপি মাইএডমিন এ কিভাবে ক্যারাকটার সেট করতে হয়পিএইচপি মাইএডমিন এ কিভাবে ক্যারাকটার সেট করতে হয়পিএইচপি মাইএডমিন এ কিভাবে ক্যারাকটার সেট করতে হয়পিএইচপি মাইএডমিন এ কিভাবে ক্যারাকটার সেট করতে হয়পিএইচপি মাইএডমিন এ কিভাবে ক্যারাকটার সেট করতে হয়পিএইচপি মাইএডমিন এ কিভাবে ক্যারাকটার সেট করতে হয়</span></p>\r\n<blockquote>\r\n<p><span style=\"font-size: 10pt; background-color: #ccffcc;\">পিএইচপি মাইএডমিন এ কিভাবে ক্যারাকটার সেট করতে হয়পিএইচপি মাইএডমিন এ কিভাবে ক্যারাকটার সেট করতে হয়পিএইচপি মাইএডমিন এ কিভাবে ক্যারাকটার সেট করতে হয়পিএইচপি মাইএডমিন এ কিভাবে ক্যারাকটার সেট করতে হয়পিএইচপি মাইএডমিন এ কিভাবে ক্যারাকটার সেট করতে হয়পিএইচপি মাইএডমিন এ কিভাবে ক্যারাকটার সেট করতে হয়পিএইচপি মাইএডমিন এ কিভাবে ক্যারাকটার সেট করতে হয়</span></p>\r\n</blockquote>\r\n<p><span style=\"font-size: 10pt; background-color: #ccffcc;\">পিএইচপি মাইএডমিন এ কিভাবে ক্যারাকটার সেট করতে হয়পিএইচপি মাইএডমিন এ কিভাবে ক্যারাকটার সেট করতে হয়পিএইচপি মাইএডমিন এ কিভাবে ক্যারাকটার সেট করতে হয়পিএইচপি মাইএডমিন এ কিভাবে ক্যারাকটার সেট করতে হয়</span></p>\r\n</body>\r\n</html>', '২১-০১-২০১৮ ৫:১৭ দুপুর', 'রাশিদুল হাসান', '13', 30),
(42, 'পিএইচপি মাইএডমিন এ কিভাবে ক্যারাকটার সেট করতে হয় ?', 'পিএইচপি জাভা সি', '<!DOCTYPE html>\r\n<html>\r\n<head>\r\n</head>\r\n<body>\r\n<p><span style=\"font-size: 10pt; background-color: #ccffcc;\">পিএইচপি মাইএডমিন এ কিভাবে ক্যারাকটার সেট করতে হয়পিএইচপি মাইএডমিন এ কিভাবে ক্যারাকটার সেট করতে হয়পিএইচপি মাইএডমিন এ কিভাবে ক্যারাকটার সেট করতে হয়পিএইচপি মাইএডমিন এ কিভাবে ক্যারাকটার সেট করতে হয়পিএইচপি মাইএডমিন এ কিভাবে ক্যারাকটার সেট করতে হয়পিএইচপি মাইএডমিন এ কিভাবে ক্যারাকটার সেট করতে হয়পিএইচপি মাইএডমিন এ কিভাবে ক্যারাকটার সেট করতে হয়পিএইচপি মাইএডমিন এ কিভাবে ক্যারাকটার সেট করতে হয়</span></p>\r\n<blockquote>\r\n<p><span style=\"font-size: 10pt; background-color: #ccffcc;\">পিএইচপি মাইএডমিন এ কিভাবে ক্যারাকটার সেট করতে হয়পিএইচপি মাইএডমিন এ কিভাবে ক্যারাকটার সেট করতে হয়পিএইচপি মাইএডমিন এ কিভাবে ক্যারাকটার সেট করতে হয়পিএইচপি মাইএডমিন এ কিভাবে ক্যারাকটার সেট করতে হয়পিএইচপি মাইএডমিন এ কিভাবে ক্যারাকটার সেট করতে হয়পিএইচপি মাইএডমিন এ কিভাবে ক্যারাকটার সেট করতে হয়পিএইচপি মাইএডমিন এ কিভাবে ক্যারাকটার সেট করতে হয়</span></p>\r\n</blockquote>\r\n<p><span style=\"font-size: 10pt; background-color: #ccffcc;\">পিএইচপি মাইএডমিন এ কিভাবে ক্যারাকটার সেট করতে হয়পিএইচপি মাইএডমিন এ কিভাবে ক্যারাকটার সেট করতে হয়পিএইচপি মাইএডমিন এ কিভাবে ক্যারাকটার সেট করতে হয়পিএইচপি মাইএডমিন এ কিভাবে ক্যারাকটার সেট করতে হয়</span></p>\r\n</body>\r\n</html>', '২১-০১-২০১৮ ৫:১৯ দুপুর', 'রাশিদুল হাসান', '13', 14),
(48, 'পিএইচপিতে কাজ করার জন্য কি কি সফটওয়ার প্রয়োজন ?', 'পিএইচপি', '<!DOCTYPE html>\r\n<html>\r\n<head>\r\n</head>\r\n<body>\r\n<p style=\"text-align: justify; background: #f0f3f5; padding: 10px;\">পিএইচপিতে কাজ করার জন্য কি কি সফটওয়ার প্রয়োজন পিএইচপিতে কাজ করার জন্য কি কি সফটওয়ার প্রয়োজন&nbsp;পিএইচপিতে কাজ করার জন্য কি কি সফটওয়ার প্রয়োজন&nbsp;পিএইচপিতে কাজ করার জন্য কি কি সফটওয়ার প্রয়োজন&nbsp;পিএইচপিতে কাজ করার জন্য কি কি সফটওয়ার প্রয়োজন&nbsp;পিএইচপিতে কাজ করার জন্য কি কি সফটওয়ার প্রয়োজন&nbsp;পিএইচপিতে কাজ করার জন্য কি কি সফটওয়ার প্রয়োজন&nbsp;পিএইচপিতে কাজ করার জন্য কি কি সফটওয়ার প্রয়োজন&nbsp;পিএইচপিতে কাজ করার জন্য কি কি সফটওয়ার প্রয়োজন&nbsp;পিএইচপিতে কাজ করার জন্য কি কি সফটওয়ার প্রয়োজন&nbsp;</p>\r\n<blockquote>\r\n<p style=\"text-align: justify;\">পিএইচপিতে কাজ করার জন্য কি কি সফটওয়ার প্রয়োজন পিএইচপিতে কাজ করার জন্য কি কি সফটওয়ার প্রয়োজন&nbsp;পিএইচপিতে কাজ করার জন্য কি কি সফটওয়ার প্রয়োজন&nbsp;পিএইচপিতে কাজ করার জন্য কি কি সফটওয়ার প্রয়োজন&nbsp;পিএইচপিতে কাজ করার জন্য কি কি সফটওয়ার প্রয়োজন&nbsp;পিএইচপিতে কাজ করার জন্য কি কি সফটওয়ার প্রয়োজন&nbsp;পিএইচপিতে কাজ করার জন্য কি কি সফটওয়ার প্রয়োজন&nbsp;পিএইচপিতে কাজ করার জন্য কি কি সফটওয়ার প্রয়োজন&nbsp;</p>\r\n</blockquote>\r\n</body>\r\n</html>', '২২-০১-২০১৮ ১১:০০ দুপুর', 'রিদয় খান', '14', 25),
(51, 'প্রোগ্রামিংয়ে  ফাংশন ওভারলোডিং বলতে কি বুজায় ?', 'জাভা সি পাইথন', '<!DOCTYPE html>\r\n<html>\r\n<head>\r\n</head>\r\n<body>\r\n<p style=\"text-align: justify; background: lightsteelblue; padding: 15px;\">প্রোগ্রামিংয়ে ফাংশন ওভারলোডিং বলতে কি বুজায় প্রোগ্রামিংয়ে ফাংশন ওভারলোডিং বলতে কি বুজায় প্রোগ্রামিংয়ে ফাংশন ওভারলোডিং বলতে কি বুজায় প্রোগ্রামিংয়ে ফাংশন ওভারলোডিং বলতে কি বুজায় প্রোগ্রামিংয়ে ফাংশন ওভারলোডিং বলতে কি বুজায় প্রোগ্রামিংয়ে ফাংশন ওভারলোডিং বলতে কি বুজায় প্রোগ্রামিংয়ে ফাংশন ওভারলোডিং বলতে কি বুজায় প্রোগ্রামিংয়ে ফাংশন ওভারলোডিং বলতে কি বুজায়</p>\r\n<blockquote>\r\n<p style=\"text-align: justify;\">প্রোগ্রামিংয়ে ফাংশন ওভারলোডিং বলতে কি বুজায় প্রোগ্রামিংয়ে ফাংশন ওভারলোডিং বলতে কি বুজায় প্রোগ্রামিংয়ে ফাংশন ওভারলোডিং বলতে কি বুজায় প্রোগ্রামিংয়ে ফাংশন ওভারলোডিং বলতে কি বুজায় প্রোগ্রামিংয়ে ফাংশন ওভারলোডিং বলতে কি বুজায় প্রোগ্রামিংয়ে ফাংশন ওভারলোডিং বলতে কি বুজায় প্রোগ্রামিংয়ে ফাংশন ওভারলোডিং বলতে কি বুজায় প্রোগ্রামিংয়ে ফাংশন ওভারলোডিং বলতে কি বুজায় প্রোগ্রামিংয়ে ফাংশন ওভারলোডিং বলতে কি বুজায়প্রোগ্রামিংয়ে ফাংশন ওভারলোডিং বলতে কি বুজায়</p>\r\n</blockquote>\r\n</body>\r\n</html>', '২৬-০১-২০১৮ ১২:১৪ দুপুর', 'সজিব খান', '17', 49),
(52, 'প্রোগ্রামিংয়ে  ইনলাইন ফাংশন বলতে কি বুজায় ?', 'জাভা সি ', '<!DOCTYPE html>\r\n<html>\r\n<head>\r\n</head>\r\n<body>\r\n<p style=\"text-align: justify; background: lightsteelblue; padding: 15px;\">প্রোগ্রামিংয়ে ইনলাইন ফাংশন বলতে কি বুজায়প্রোগ্রামিংয়ে ইনলাইন ফাংশন বলতে কি বুজায়প্রোগ্রামিংয়ে ইনলাইন ফাংশন বলতে কি বুজায়প্রোগ্রামিংয়ে ইনলাইন ফাংশন বলতে কি বুজায়প্রোগ্রামিংয়ে ইনলাইন ফাংশন বলতে কি বুজায়প্রোগ্রামিংয়ে ইনলাইন ফাংশন বলতে কি বুজায়প্রোগ্রামিংয়ে ইনলাইন ফাংশন বলতে কি বুজায়প্রোগ্রামিংয়ে ইনলাইন ফাংশন বলতে কি বুজায়</p>\r\n<blockquote>\r\n<p style=\"text-align: justify;\">প্রোগ্রামিংয়ে ইনলাইন ফাংশন বলতে কি বুজায়প্রোগ্রামিংয়ে ইনলাইন ফাংশন বলতে কি বুজায়প্রোগ্রামিংয়ে ইনলাইন ফাংশন বলতে কি বুজায়প্রোগ্রামিংয়ে ইনলাইন ফাংশন বলতে কি বুজায়প্রোগ্রামিংয়ে ইনলাইন ফাংশন বলতে কি বুজায়প্রোগ্রামিংয়ে ইনলাইন ফাংশন বলতে কি বুজায়প্রোগ্রামিংয়ে ইনলাইন ফাংশন বলতে কি বুজায়প্রোগ্রামিংয়ে ইনলাইন ফাংশন বলতে কি বুজায়প্রোগ্রামিংয়ে ইনলাইন ফাংশন বলতে কি বুজায়প্রোগ্রামিংয়ে ইনলাইন ফাংশন বলতে কি বুজায়</p>\r\n</blockquote>\r\n</body>\r\n</html>', '২৬-০১-২০১৮ ১২:২৪ দুপুর', 'শাকিল খান', '16', 89),
(53, 'ফটোসিনথেসিস বলতে কি বুজায় ?', 'পদার্থ', '<!DOCTYPE html>\r\n<html>\r\n<head>\r\n</head>\r\n<body>\r\n<p style=\"text-align: justify; padding: 15px; background: #f9f9f9;\">ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায় ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায়</p>\r\n<blockquote>\r\n<p style=\"text-align: justify;\">ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায়ফটোসিনথেসিস বলতে কি বজায়</p>\r\n</blockquote>\r\n</body>\r\n</html>', '০৩-০২-২০১৮ ৩:১৩ দুপুর', 'রিদয় খান', '14', 133),
(54, 'সি প্যনেল এ কিভাবে ওয়ার্ডপ্রেস ইন্সটল করতে হয় ? ', 'ওয়ার্ডপ্রেস সি-প্যনেল ', '<!DOCTYPE html>\r\n<html>\r\n<head>\r\n</head>\r\n<body>\r\n<p style=\"text-align: justify; padding: 15px; background: lightgray;\">সি প্যনেল এ কিভাবে ওয়ার্ডপ্রেস ইন্সটল করতে হয় সি প্যনেল এ কিভাবে ওয়ার্ডপ্রেস ইন্সটল করতে হয় সি প্যনেল এ কিভাবে ওয়ার্ডপ্রেস ইন্সটল করতে হয় সি প্যনেল এ কিভাবে ওয়ার্ডপ্রেস ইন্সটল করতে হয় সি প্যনেল এ কিভাবে ওয়ার্ডপ্রেস ইন্সটল করতে হয়সি প্যনেল এ কিভাবে ওয়ার্ডপ্রেস ইন্সটল করতে হয় সি প্যনেল এ কিভাবে ওয়ার্ডপ্রেস ইন্সটল করতে হয়</p>\r\n<blockquote>\r\n<p style=\"text-align: justify;\">সি প্যনেল এ কিভাবে ওয়ার্ডপ্রেস ইন্সটল করতে হয় সি প্যনেল এ কিভাবে ওয়ার্ডপ্রেস ইন্সটল করতে হয় সি প্যনেল এ কিভাবে ওয়ার্ডপ্রেস ইন্সটল করতে হয় সি প্যনেল এ কিভাবে ওয়ার্ডপ্রেস ইন্সটল করতে হয় সি প্যনেল এ কিভাবে ওয়ার্ডপ্রেস ইন্সটল করতে হয় সি প্যনেল এ কিভাবে ওয়ার্ডপ্রেস ইন্সটল করতে হয় সি প্যনেল এ কিভাবে ওয়ার্ডপ্রেস ইন্সটল করতে হয় সি প্যনেল এ কিভাবে ওয়ার্ডপ্রেস ইন্সটল করতে হয় সি প্যনেল এ কিভাবে ওয়ার্ডপ্রেস ইন্সটল করতে হয় সি প্যনেল এ কিভাবে ওয়ার্ডপ্রেস ইন্সটল করতে হয়</p>\r\n</blockquote>\r\n</body>\r\n</html>', '১৪-০২-২০১৮ ৮:৪৭ দুপুর', 'মোবারক হোসেন', '15', 164),
(61, 'প্রোগ্রামিংয়ে অপারেটর ওভারলোডিং বলতে কি বুজায় ?', 'জাভা পাইথন সি', '<!DOCTYPE html>\r\n<html>\r\n<head>\r\n</head>\r\n<body>\r\n<blockquote>\r\n<p style=\"text-align: justify;\">প্রোগ্রামিংয়ে অপারেটর ওভারলোডিং বলতে কি বুজায়।প্রোগ্রামিংয়ে অপারেটর ওভারলোডিং বলতে কি বুজায়।প্রোগ্রামিংয়ে অপারেটর ওভারলোডিং বলতে কি বুজায়।প্রোগ্রামিংয়ে অপারেটর ওভারলোডিং বলতে কি বুজায়।প্রোগ্রামিংয়ে অপারেটর ওভারলোডিং বলতে কি বুজায়।প্রোগ্রামিংয়ে অপারেটর ওভারলোডিং বলতে কি বুজায়।প্রোগ্রামিংয়ে অপারেটর ওভারলোডিং বলতে কি বুজায়।প্রোগ্রামিংয়ে অপারেটর ওভারলোডিং বলতে কি বুজায়।প্রোগ্রামিংয়ে অপারেটর ওভারলোডিং বলতে কি বুজায়।প্রোগ্রামিংয়ে অপারেটর ওভারলোডিং বলতে কি বুজায়।</p>\r\n</blockquote>\r\n<blockquote>\r\n<p style=\"text-align: justify; padding: 10px; background: lightgray;\">প্রোগ্রামিংয়ে অপারেটর ওভারলোডিং বলতে কি বুজায়।প্রোগ্রামিংয়ে অপারেটর ওভারলোডিং বলতে কি বুজায়।প্রোগ্রামিংয়ে অপারেটর ওভারলোডিং বলতে কি বুজায়।প্রোগ্রামিংয়ে অপারেটর ওভারলোডিং বলতে কি বুজায়।প্রোগ্রামিংয়ে অপারেটর ওভারলোডিং বলতে কি বুজায়।প্রোগ্রামিংয়ে অপারেটর ওভারলোডিং বলতে কি বুজায়।প্রোগ্রামিংয়ে অপারেটর ওভারলোডিং বলতে কি বুজায়।প্রোগ্রামিংয়ে অপারেটর ওভারলোডিং বলতে কি বুজায়।প্রোগ্রামিংয়ে অপারেটর ওভারলোডিং বলতে কি বুজায়।প্রোগ্রামিংয়ে অপারেটর ওভারলোডিং বলতে কি বুজায়।</p>\r\n</blockquote>\r\n</body>\r\n</html>', '২৭-০৭-২০১৮ ৯:১৬ দুপুর', 'রাশিদুল হাসান', '13', 19);

-- --------------------------------------------------------

--
-- Table structure for table `question_choose`
--

CREATE TABLE `question_choose` (
  `id` int(11) NOT NULL,
  `user_id` varchar(200) NOT NULL,
  `ques_id` varchar(200) NOT NULL,
  `choose_value` varchar(200) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `question_choose`
--

INSERT INTO `question_choose` (`id`, `user_id`, `ques_id`, `choose_value`) VALUES
(13, '14', '41', '1'),
(14, '14', '41', '1'),
(16, ' 44', '54 ', '1'),
(17, ' 44', '54 ', '1'),
(21, '13', '54  ', '1'),
(22, '13', '41 ', '1'),
(23, '13', '50 ', '1'),
(24, '13', '50  ', '1'),
(25, '13', '51 ', '1'),
(26, '13', '51  ', '1'),
(27, '13', '48 ', '1'),
(28, '13', '42 ', '1'),
(29, '13', '34 ', '1'),
(30, '13', '40 ', '1'),
(31, '15', '41 ', '1'),
(32, '14', '61 ', '1'),
(33, '17', '40 ', '1');

-- --------------------------------------------------------

--
-- Table structure for table `secondary_lesson`
--

CREATE TABLE `secondary_lesson` (
  `id` int(11) NOT NULL,
  `class` varchar(200) CHARACTER SET utf8 NOT NULL,
  `subject` varchar(200) CHARACTER SET utf8 NOT NULL,
  `title` varchar(200) CHARACTER SET utf8 NOT NULL,
  `content` text CHARACTER SET utf8 NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `secondary_lesson`
--

INSERT INTO `secondary_lesson` (`id`, `class`, `subject`, `title`, `content`) VALUES
(1, '6', 'বাংলা', 'ভূমিকা', '<p>১৯৫১-৫২ খ্রিস্টাব্দে পূর্ব পাকিস্তানে সংগঠিত বাংলা ভাষা আন্দোলন এই ভাষার সাথে বাঙালি অস্তিত্বের যোগসূত্র স্থাপন করেছিল। ১৯৫২ খ্রিস্টাব্দের ২১শে ফেব্রুয়ারি, ঢাকা বিশ্ববিদ্যালয়ে প্রতিবাদী ছাত্র ও আন্দোলনকারীরা মাতৃভাষা বাংলায় কথা বলা ও লেখাপড়ার অধিকারের দাবীতে নিজেদের জীবন উৎসর্গ করেন। মাতৃভাষার জন্য তাঁদের বলিদানের স্বীকৃতি স্বরূপ ১৯৯৯ খ্রিস্টাব্দে ইউনেস্কো ২১শে ফেব্রুয়ারি দিনটিকে আন্তর্জাতিক মাতৃভাষা দিবস হিসেবে ঘোষণা করে</p>\r\n<blockquote>\r\nদক্ষিণ এশিয়ার বঙ্গ অঞ্চলের স্থানীয় ভাষা, এই অঞ্চলটি বর্তমানে রাজনৈতিকভাবে স্বাধীন রাষ্ট্র বাংলাদেশ ও ভারতের অঙ্গরাজ্য পশ্চিমবঙ্গ নিয়ে গঠিত। এছাড়াও ভারতের ত্রিপুরা রাজ্য, অসম রাজ্যের বরাক উপত্যকা এবং আন্দামান দ্বীপপুঞ্জেও বাংলা ভাষাতে কথা বলা হয়। এই ভাষার লিপি হল বাংলা লিপি। এই অঞ্চলের প্রায় বাইশ কোটি স্থানীয় মানুষের ও পৃথিবীর মোট ৩০ কোটি মানুষের ভাষা হওয়ায়, এই ভাষা বিশ্বের সর্বাধিক প্রচলিত ভাষাগুলির মধ্যে চতুর্থ স্থান অধিকার করেছে। বাংলাদেশ, ভারত ও শ্রীলঙ্কার জাতীয় সঙ্গীত, এবং ভারতের জাতীয় স্তোত্র এই ভাষাতেই রচিত এবং তা থেকেই দক্ষিণ এশিয়ায় এই ভাষার গুরুত্ব বোঝা যায়।\r\nবাংলাদেশ ও পশ্চিমবঙ্গে প্রচলিত বাংলা ভাষার মধ্যে ব্যবহার, উচ্চারণ ও ধ্বনিতত্ত্বের সামান্য পার্থক্য রয়েছে। বর্তমানে, বাংলা ও তার বিভিন্ন উপভাষা বাংলাদেশের প্রধান ভাষা এবং ভারতে দ্বিতীয় সর্বাধিক প্রচলিত ভাষা। এই ভাষা বাংলার নবজাগরণের ফলে সৃষ্ট বাংলা সাহিত্যের সমৃদ্ধ ঐতিহ্য নির্মাণ ও বাংলার সাংস্কৃতিক বিবিধতাকে এক সূত্রে গ্রথিত করেছে, শুধু তাই নয়, এই ভাষা বাঙালি জাতীয়তাবাদ গঠনে অন্যতম গুরুত্বপূর্ণ ভূমিকা পালন করেছে।</blockquote>\r\n১৯৫১-৫২ খ্রিস্টাব্দে পূর্ব পাকিস্তানে সংগঠিত বাংলা ভাষা আন্দোলন এই ভাষার সাথে বাঙালি অস্তিত্বের যোগসূত্র স্থাপন করেছিল। ১৯৫২ খ্রিস্টাব্দের ২১শে ফেব্রুয়ারি, ঢাকা বিশ্ববিদ্যালয়ে প্রতিবাদী ছাত্র ও আন্দোলনকারীরা মাতৃভাষা বাংলায় কথা বলা ও লেখাপড়ার অধিকারের দাবীতে নিজেদের জীবন উৎসর্গ করেন। মাতৃভাষার জন্য তাঁদের বলিদানের স্বীকৃতি স্বরূপ ১৯৯৯ খ্রিস্টাব্দে ইউনেস্কো ২১শে ফেব্রুয়ারি দিনটিকে আন্তর্জাতিক মাতৃভাষা দিবস হিসেবে ঘোষণা করে'),
(2, '6', 'বাংলা', 'ইতিহাস', 'খ্রিস্টীয় দশম থেকে দ্বাদশ শতাব্দীর মধ্যবর্তী সময়কালে মাগধী প্রাকৃত ও পালির মতো পূর্ব মধ্য ইন্দো-আর্য ভাষাসমূহ থেকে বাংলা ও অন্যান্য পূর্ব ইন্দো-আর্য ভাষাগুলির উদ্ভব ঘটে।[১২] এই অঞ্চলে কথ্য ভাষা প্রথম সহস্রাব্দে মাগধী প্রাকৃত বা অর্ধমাগধী ভাষায় বিবর্তিত হয়।[১৩][১৪] খ্রিস্টীয় দশম শতাব্দীর শুরুতে উত্তর ভারতের অন্যান্য প্রাকৃত ভাষার মতোই মাগধী প্রাকৃত থেকে অপভ্রংশ ভাষাগুলির উদ্ভব ঘটে।[১৫] পূর্বী অপভ্রংশ বা অবহট্‌ঠ নামক পূর্ব উপমহাদেশের স্থানীয় অপভ্রংশ ভাষাগুলি ধীরে ধীরে আঞ্চলিক কথ্য ভাষায় বিবর্তিত হয়, যা মূলতঃ ওড়িয়া ভাষা, বাংলা-অসমীয়া ও বিহারী ভাষাসমূহের জন্ম দেয়। কোনো কোনো ভাষাবিদ ৫০০ খ্রিস্টাব্দে এই তিন ভাষার জন্ম বলে মনে করলেও [১৬] এই ভাষাটি তখন পর্যন্ত কোনো সুস্থির রূপ ধারণ করেনি; সে সময় এর বিভিন্ন লিখিত ও ঔপভাষিক রূপ পাশাপাশি বিদ্যমান ছিল। যেমন, ধারণা করা হয়, আনুমানিক ষষ্ঠ শতাব্দীতে মাগধী অপভ্রংশ থেকে অবহট্‌ঠের উদ্ভব ঘটে, যা প্রাক-বাংলা ভাষাগুলির সঙ্গে কিছু সময় ধরে সহাবস্থান করছিল। [১৭]\r\n\r\nচৈতন্য মহাপ্রভুর যুগে ও বাংলার নবজাগরণের সময় বাংলা সাহিত্য সংস্কৃত ভাষা দ্বারা অত্যন্ত প্রভাবিত হয়েছিল।[১৮] সংস্কৃত থেকে যে সমস্ত শব্দ বাংলা ভাষায় যোগ করা হয়, তাঁদের উচ্চারণ অন্যান্য বাংলা রীতি মেনে পরিবর্তিত হলেও সংস্কৃত বানান অপরিবর্তিত রাখা হয়। বাংলা ভাষার ব্যাপক পৃষ্ঠপোষকতা করেন বাংলার মুসলিম শাসকগোষ্ঠী। ফার্সির পাশাপাশি বাংলাও বাংলার সালতানাতের দাফতরিক ভাষা হিসেবে স্বীকৃত ছিলো এবং ব্যাপক হারে ব্যবহার হতো। এছাড়াও প্রোটো বাংলা ছিলো পাল এবং সেন সাম্রাজ্যের প্রধান ভাষা।\r\n\r\nঊনবিংশ ও বিংশ শতাব্দীতে নদিয়া অঞ্চলে প্রচলিত পশ্চিম-মধ্য বাংলা কথ্য ভাষার ওপর ভিত্তি করে আধুনিক বাংলা সাহিত্য গড়ে ওঠে। বিভিন্ন আঞ্চলিক কথ্য বাংলা ভাষা ও আধুনিক বাংলা সাহিত্যে ব্যবহৃত ভাষার মধে অনেকখানি পার্থক্য রয়েছে।[১৯] আধুনিক বাংলা শব্দভাণ্ডারে মাগধী প্রাকৃত, পালি, সংস্কৃত, ফার্সি, আরবি ভাষা এবং অস্ট্রোএশিয়াটিক ভাষাসমূহ সহ অন্যান্য ভাষা পরিবারের শব্দ স্থান পেয়েছে।\r\nচর্যাপদের একটি পৃষ্ঠা\r\n\r\nবাংলা ভাষার ইতিহাসকে সাধারণত তিন ভাগে ভাগ করা হয়:[১৫]\r\n\r\n    প্রাচীন বাংলা (৯০০/১০০০ – ১৪০০ খ্রিস্টাব্দ) — চর্যাপদ, ভক্তিমূলক গান এই সময়কার লিখিত নিদর্শন। এই সময় আমি, তুমি ইত্যাদি সর্বনাম এবং -ইলা, -ইবা, ইত্যাদি ক্রিয়াবিভক্তির আবির্ভাব ঘটে।\r\n    মধ্য বাংলা (১৪০০–১৮০০ খ্রিস্টাব্দ) — এ সময়কার গুরুত্বপূর্ণ লিখিত নিদর্শন চণ্ডীদাসের শ্রীকৃষ্ণকীর্তন ইত্যাদি। শব্দের শেষে \"অ\" ধ্বনির বিলোপ, যৌগিক ক্রিয়ার প্রচলন, ফার্সি ভাষার প্রভাব এই সময়ের সাহিত্যে লক্ষ্য করা যায়। কোনো কোনো ভাষাবিদ এই যুগকে আদি ও অন্ত্য এই দুই ভাগে ভাগ করেন।\r\n    আধুনিক বাংলা (১৮০০ খ্রিস্টাব্দ থেকে-বর্তমান) — এই সময় ক্রিয়া ও সর্বনামের সংক্ষেপণ ঘটে, যেমন তাহার → তার; করিয়াছিল → করেছিল।\r\n\r\n<p>অষ্টাদশ শতাব্দীর পূর্বে, বাংলা ব্যাকরণ রচনার কোন উদ্যোগ নেওয়া হয়নি। ১৭৩৪ থেকে ১৭৪২ খ্রিস্টাব্দের মধ্যে ভাওয়াল জমিদারীতে কর্মরত অবস্থায় পর্তুগিজ মিশনারি পাদ্রি ম্যানুয়েল দ্য আসুম্পসাও সর্বপ্রথম ভোকাবোলারিও এম ইডিওমা বেঙ্গালা, এ পোর্তুগুয়েজ ডিভিডিডো এম দুয়াস পার্তেস (পর্তুগিজ: Vocabolario em idioma Bengalla, e Portuguez dividido em duas partes) নামক বাংলা ভাষার অভিধান ও ব্যাকরণ রচনা করেন। [২০] ন্যাথানিয়েল ব্র্যাসি হ্যালহেড নামক এক ইংরেজ ব্যাকরণবিদবিদ আ গ্রামার অব দ্য বেঙ্গল ল্যাঙ্গুয়েজ (ইংরেজি: A Grammar of the Bengal Language) নামক গ্রন্থে একটি আধুনিক বাংলা ব্যাকরণ রচনা করেন, যেখানে ছাপাখানার বাংলা হরফ প্রথম ব্যবহৃত হয়। [৪] বাঙালি সমাজসংস্কারক রাজা রামমোহন রায়[২১] ১৮৩২ খ্রিস্টাব্দে গ্র্যামার অফ্ দ্য বেঙ্গলি ল্যাঙ্গুয়েজ্ (ইংরেজি: Grammar of the Bengali Language) নামক একটি ব্যাকরণ গ্রন্থ রচনা করেন।</p>\r\n\r\n১৯৫১–৫২ সালে পূর্ব পাকিস্তানে বাঙালি জনগণের প্রবল ভাষা সচেতনতার ফলস্বরূপ বাংলা ভাষা আন্দোলন নামক একটি ভাষা আন্দোলন গড়ে ওঠে। এই আন্দোলনে পাকিস্তান সরকারের নিকট বাংলা ভাষার সরকারি স্বীকৃতি দাবী কর হয়। ১৯৫২ খ্রিস্টাব্দে ২১শে ফেব্রুয়ারি ঢাকা বিশ্ববিদ্যালয় চত্বরে বহু ছাত্র ও রাজনৈতিক কর্মী নিহত হন। বাংলাদেশে প্রতি বছর ২১শে ফেব্রুয়ারি ভাষা আন্দোলন দিবস পালিত হয়। ১৯৯৯ খ্রিস্টাব্দের ১৭ই নভেম্বর ইউনেস্কো এই দিনটিকে আন্তর্জাতিক মাতৃভাষা দিবসের মর্যাদা প্রদান করে।\r\n\r\n<p>বাংলাদেশ ছাড়াও ১৯৫০-এর দশকে ভারতের বিহার রাজ্যের মানভূম জেলায় বাংলা ভাষা আন্দোলন ঘটে। ১৯৬১ খ্রিস্টাব্দের ভারতের অসম রাজ্যের বরাক উপত্যকায় একইরকম ভাবে বাংলা ভাষা আন্দোলন সংগঠিত হয়। ১৯ মে, শিলচরে বাংলা ভাষার দাবীতে আন্দোলনরত ১১ জন পুলিশের গুলিতে শহীদ হন।</p>');

-- --------------------------------------------------------

--
-- Table structure for table `secondary_subjects`
--

CREATE TABLE `secondary_subjects` (
  `id` int(11) NOT NULL,
  `subject` varchar(150) CHARACTER SET utf8 NOT NULL,
  `class` varchar(150) CHARACTER SET utf8 NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `secondary_subjects`
--

INSERT INTO `secondary_subjects` (`id`, `subject`, `class`) VALUES
(12, 'বাংলা', '7'),
(19, 'বাংলা', '6'),
(21, 'ইংরেজী', '6'),
(22, 'গণিত', '6'),
(23, 'ইংরেজী', '7'),
(24, 'বাংলা', '8');

-- --------------------------------------------------------

--
-- Table structure for table `site_logo`
--

CREATE TABLE `site_logo` (
  `id` int(11) NOT NULL,
  `logo` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `site_logo`
--

INSERT INTO `site_logo` (`id`, `logo`) VALUES
(1, '5b59a23203ac35b35c6fec9ed5brand-logo1.png');

-- --------------------------------------------------------

--
-- Table structure for table `site_slogan`
--

CREATE TABLE `site_slogan` (
  `id` int(11) NOT NULL,
  `slogan_one` varchar(255) CHARACTER SET utf8 NOT NULL,
  `slogan_two` varchar(255) CHARACTER SET utf8 NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `site_slogan`
--

INSERT INTO `site_slogan` (`id`, `slogan_one`, `slogan_two`) VALUES
(2, 'বাংলা ভাষায় প্রথম পূর্ণাঙ্গ অনলাইন একাডেমী', 'নিজে শিখুন, অন্যকে শিখান');

-- --------------------------------------------------------

--
-- Table structure for table `sociallink`
--

CREATE TABLE `sociallink` (
  `id` int(11) NOT NULL,
  `facebook` varchar(255) NOT NULL,
  `youtube` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `sociallink`
--

INSERT INTO `sociallink` (`id`, `facebook`, `youtube`) VALUES
(1, '#', '#');

-- --------------------------------------------------------

--
-- Table structure for table `university_course_info`
--

CREATE TABLE `university_course_info` (
  `id` int(11) NOT NULL,
  `department` varchar(255) CHARACTER SET utf8 NOT NULL,
  `course_name` varchar(255) CHARACTER SET utf8mb4 NOT NULL,
  `course_info` text CHARACTER SET utf8 NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `university_course_info`
--

INSERT INTO `university_course_info` (`id`, `department`, `course_name`, `course_info`) VALUES
(1, 'সিএসই', 'জাভা', 'জাভা হচ্ছে একটি অবজেক্ট ওরিয়েন্টেড প্রোগ্রামিং ল্যাঙ্গুয়েজ। ১৯৯১ সালে সান মাইক্রোসিস্টেমে (sun microsystem) জেমস গসলিং ( James Gosling ) এর নেতৃত্বে একটি টিম জাভা ডেভেলপ করেছিলেন। জাভা এর বেশিরভাগ সিনট্যাক্স সি এবং সি++ থেকে নেয়া।<br><br>\r\nজাভা প্রোগ্রামিং ভাষা সহজ এবং এর বহনযোগ্যতা (portability), নিরাপত্তা ও কর্যক্ষমতার কারণে ওয়েব এবং সফটওয়্যার ডেভেলপারদের কাছে জাভা বেশ জনপ্রিয়।'),
(2, 'সিএসই', 'সি', 'সি একটি প্রোগ্রামিং ভাষা। সি নির্মাণ করেন ডেনিস রিচি, বেল ল্যাবে ৭০এর দশকে কাজ করার সময়। ভাষাটি তৈরির প্রথম উদ্দেশ্য ছিল ইউনিক্স- অপারেটিং সিস্টেম এর কোড লেখায় এর ব্যবহার, কিন্তু অচিরেই এটি একটি বহুল ব্যবহৃত ভাষায় পরিণত হয়।<br><br>\r\nসি++ ও জাভা সহ পরিবর্তীকালের অনেক প্রোগ্রামিং ভাষার উপর সি\'র গভীর প্রভাব পড়েছে। সি এর সবচেয়ে আকর্ষণীয় দিক হচ্ছে এর বহনযোগ্যতা।'),
(3, 'আইসিটি', 'পিএইচপি', 'পিএইচপি একটি প্রোগ্রামিং ল্যাঙ্গুয়েজ। পিএইচপি একটি প্রোগ্রামিং ল্যাঙ্গুয়েজ। পিএইচপি একটি প্রোগ্রামিং ল্যাঙ্গুয়েজ।জাবা একটি প্রোগ্রামিং ল্যাঙ্গুয়েজ। পিএইচপি একটি প্রোগ্রামিং ল্যাঙ্গুয়েজ।সি একটি প্রোগ্রামিং ল্যাঙ্গুয়েজ। পিএইচপি একটি প্রোগ্রামিং ল্যাঙ্গুয়েজ। পিএইচপি একটি প্রোগ্রামিং ল্যাঙ্গুয়েজ। পিএইচপি একটি প্রোগ্রামিং ল্যাঙ্গুয়েজ।সি একটি প্রোগ্রামিং ল্যাঙ্গুয়েজ।'),
(6, 'সিএসই', 'পাইথন', '<!DOCTYPE html>\r\n<html>\r\n<head>\r\n</head>\r\n<body>\r\nপাইথন (Python) একটি বস্তু-সংশ্লিষ্ট (object-oriented) উচ্চস্তরের প্রোগ্রামিং ভাষা। ১৯৯১ সালে গুইডো ভ্যান রস্যিউম এটি প্রথম প্রকাশ করেন। পাইথন নির্মাণ করার সময় প্রোগ্রামের পঠনযোগ্যতার উপর বেশি গুরুত্ব দেয়া হয়েছে। এখানে প্রোগ্রামারের পরিশ্রমকে কম্পিউটারের চেয়ে বেশি গুরুত্ব দেয়া হয়েছে।<br><br>\r\nপাইথন ভাষার মুক্ত, কমিউনিটি-ভিত্তিক উন্নয়ন মডেল রয়েছে, যার দায়িত্বে আছে পাইথন সফটওয়্যার ফাউন্ডেশন নামের একটি অলাভজনক প্রতিষ্ঠান।\r\n</body>\r\n</html>');

-- --------------------------------------------------------

--
-- Table structure for table `university_course_list`
--

CREATE TABLE `university_course_list` (
  `id` int(11) NOT NULL,
  `faculty` varchar(255) CHARACTER SET utf8 NOT NULL,
  `department` varchar(255) CHARACTER SET utf8 NOT NULL,
  `course_name` varchar(255) CHARACTER SET utf8 NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `university_course_list`
--

INSERT INTO `university_course_list` (`id`, `faculty`, `department`, `course_name`) VALUES
(1, 'প্রোকৌশল', 'সিএসই', 'জাভা');

-- --------------------------------------------------------

--
-- Table structure for table `university_department`
--

CREATE TABLE `university_department` (
  `id` int(11) NOT NULL,
  `faculty` varchar(255) CHARACTER SET utf8 NOT NULL,
  `department` varchar(255) CHARACTER SET utf8 NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `university_department`
--

INSERT INTO `university_department` (`id`, `faculty`, `department`) VALUES
(1, 'প্রোকৌশল', 'সিএসই'),
(3, 'প্রোকৌশল', ' 	আইসিটি'),
(6, 'বিজ্ঞান', 'গণিত');

-- --------------------------------------------------------

--
-- Table structure for table `university_lessons`
--

CREATE TABLE `university_lessons` (
  `id` int(11) NOT NULL,
  `faculty` varchar(255) CHARACTER SET utf8 NOT NULL,
  `department` varchar(255) CHARACTER SET utf8 NOT NULL,
  `course_name` varchar(255) CHARACTER SET utf8 NOT NULL,
  `title` varchar(255) CHARACTER SET utf8 NOT NULL,
  `content` text CHARACTER SET utf8 NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `university_lessons`
--

INSERT INTO `university_lessons` (`id`, `faculty`, `department`, `course_name`, `title`, `content`) VALUES
(1, 'প্রোকৌশল', 'সিএসই', 'জাভা', 'জাভা কি ?', '<!DOCTYPE html>\r\n<html>\r\n<head>\r\n</head>\r\n<body>\r\n<p style=\"text-align: justify; border: 10px solid lightgray; padding: 31px 21px; box-shadow: 1px 1px 5px 1px gray;font-size: 17px;line-height: 30px;\">জাভা হচ্ছে একটি অবজেক্ট ওরিয়েন্টেড প্রোগ্রামিং ল্যাঙ্গুয়েজ। ১৯৯১ সালে সান মাইক্রোসিস্টেমে (sun microsystem) জেমস গসলিং ( James Gosling ) এর নেতৃত্বে একটি টিম জাভা ডেভেলপ করেছিলেন। জাভা এর বেশিরভাগ সিনট্যাক্স সি এবং সি++ থেকে নেয়া।জাভা প্রোগ্রামিং ভাষা সহজ এবং এর বহনযোগ্যতা (portability), নিরাপত্তা ও কর্যক্ষমতার কারণে ওয়েব এবং সফটওয়্যার ডেভেলপারদের কাছে জাভা বেশ জনপ্রিয়।</p>\r\n<blockquote style=\"text-align: justify; padding: 12px;margin-top: 25px;\">জাভার সবচেয়ে বড় সুবিদা হচ্ছে জাভা প্রোগ্রাম যেকোন অপারেটিং সিস্টেমে (Windows, Mac, Linux) রান করানো যায় যা অন্য প্রোগ্রামিং ল্যাঙ্গুয়েজের ক্ষেত্রে করা যায় না। ২০১০ সালে ওরাকল (oracle) সান মাইক্রোসিস্টেমকে কিনে নেয়।</blockquote>\r\n</body>\r\n</html>'),
(2, 'প্রোকৌশল', 'সিএসই', 'জাভা', 'ভাষার সাথে বাঙালি', '<p>মাতৃভাষার জন্য তাঁদের বলিদানের স্বীকৃতি স্বরূপ ১৯৯৯ খ্রিস্টাব্দে ইউনেস্কো ২১শে ফেব্রুয়ারি দিনটিকে আন্তর্জাতিক মাতৃভাষা দিবস হিসেবে ঘোষণা করে</p>\r\n<blockquote>\r\nদক্ষিণ এশিয়ার বঙ্গ অঞ্চলের স্থানীয় ভাষা, এই অঞ্চলটি বর্তমানে রাজনৈতিকভাবে স্বাধীন রাষ্ট্র বাংলাদেশ ও ভারতের অঙ্গরাজ্য পশ্চিমবঙ্গ নিয়ে গঠিত। এছাড়াও ভারতের ত্রিপুরা রাজ্য, অসম রাজ্যের বরাক উপত্যকা এবং আন্দামান দ্বীপপুঞ্জেও বাংলা ভাষাতে কথা বলা হয়। এই ভাষার লিপি হল বাংলা লিপি। এই অঞ্চলের প্রায় বাইশ কোটি স্থানীয় মানুষের ও পৃথিবীর মোট ৩০ কোটি মানুষের ভাষা হওয়ায়, এই ভাষা বিশ্বের সর্বাধিক প্রচলিত ভাষাগুলির মধ্যে চতুর্থ স্থান অধিকার করেছে। বাংলাদেশ, ভারত ও শ্রীলঙ্কার জাতীয় সঙ্গীত, এবং ভারতের জাতীয় স্তোত্র এই ভাষাতেই রচিত এবং তা থেকেই দক্ষিণ এশিয়ায় এই ভাষার গুরুত্ব বোঝা যায়।\r\nবাংলাদেশ ও পশ্চিমবঙ্গে প্রচলিত বাংলা ভাষার মধ্যে ব্যবহার, উচ্চারণ ও ধ্বনিতত্ত্বের সামান্য পার্থক্য রয়েছে। বর্তমানে, বাংলা ও তার বিভিন্ন উপভাষা বাংলাদেশের প্রধান ভাষা এবং ভারতে দ্বিতীয় সর্বাধিক প্রচলিত ভাষা। এই ভাষা বাংলার নবজাগরণের ফলে সৃষ্ট বাংলা সাহিত্যের সমৃদ্ধ ঐতিহ্য নির্মাণ ও বাংলার সাংস্কৃতিক বিবিধতাকে এক সূত্রে গ্রথিত করেছে, শুধু তাই নয়, এই ভাষা বাঙালি জাতীয়তাবাদ গঠনে অন্যতম গুরুত্বপূর্ণ ভূমিকা পালন করেছে।</blockquote>\r\n১৯৫১-৫২ খ্রিস্টাব্দে পূর্ব পাকিস্তানে সংগঠিত বাংলা ভাষা আন্দোলন এই ভাষার সাথে বাঙালি অস্তিত্বের যোগসূত্র স্থাপন করেছিল। ১৯৫২ খ্রিস্টাব্দের ২১শে ফেব্রুয়ারি, ঢাকা বিশ্ববিদ্যালয়ে প্রতিবাদী ছাত্র ও আন্দোলনকারীরা মাতৃভাষা বাংলায় কথা বলা ও লেখাপড়ার অধিকারের দাবীতে নিজেদের জীবন উৎসর্গ করেন। মাতৃভাষার জন্য তাঁদের বলিদানের স্বীকৃতি স্বরূপ ১৯৯৯ খ্রিস্টাব্দে ইউনেস্কো ২১শে ফেব্রুয়ারি দিনটিকে আন্তর্জাতিক মাতৃভাষা দিবস হিসেবে ঘোষণা করে');

-- --------------------------------------------------------

--
-- Table structure for table `user_info`
--

CREATE TABLE `user_info` (
  `id` int(11) NOT NULL,
  `Full_Name` varchar(150) CHARACTER SET utf8 NOT NULL,
  `Email` varchar(150) NOT NULL,
  `Password` varchar(150) NOT NULL,
  `Phone` varchar(50) CHARACTER SET utf8 NOT NULL,
  `Tags` varchar(180) CHARACTER SET utf8 NOT NULL,
  `DB_Day` varchar(50) NOT NULL,
  `DB_Month` varchar(50) NOT NULL,
  `DB_Year` varchar(50) NOT NULL,
  `Sex` varchar(50) NOT NULL,
  `Address` text CHARACTER SET utf8 NOT NULL,
  `Picture` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `user_info`
--

INSERT INTO `user_info` (`id`, `Full_Name`, `Email`, `Password`, `Phone`, `Tags`, `DB_Day`, `DB_Month`, `DB_Year`, `Sex`, `Address`, `Picture`) VALUES
(13, 'রাশিদুল হাসান', 'likhansherpur@gmail.com', '12345', '০১৭৫৪৭৫২৮৭৩', 'পিএইচপি জাভা', '31', '8', '1994', 'male', 'বঙ্গবন্ধু শেখ মুজিবুর রহমান হল, কুমিল্লা বিশ্ববিদ্যাল্যয় কুমিল্লা, বাংলাদেশ', '5b5abd033b20fLikhon.jpg'),
(14, 'রিদয় খান', 'riday@gmail.com', '12345', '০১৭৮১২৮৫১৭৭', 'জাভা', '17', '8', '1970', 'male', 'বঙ্গবন্ধু শেখ মুজিবুর রহমান হল, কুমিল্লা বিশ্ববিদ্যাল্যয় কুমিল্লা, বাংলাদেশ			', '5b59acf237885riday.jpg'),
(15, 'মোবারক হোসেন', 'mobarak@gmail.com', '12345', '০১৭৫৪৭৩৬৫৭৪', 'জাভা সি', '2', '5', '1994', 'male', 'বঙ্গবন্ধু শেখ মুজিবুর রহমান হল, কুমিল্লা বিশ্ববিদ্যাল্যয় কুমিল্লা, বাংলাদেশ	', '5b59aaec4e92emobarak.jpg'),
(16, 'শাকিল খান', 'shakil@gmail.com', '12345', '01754752871', 'জেকুয়েরি', '5', '5', '1958', 'male', 'বঙ্গবন্ধু শেখ মুজিবুর রহমান হল, কুমিল্লা বিশ্ববিদ্যাল্যয় কুমিল্লা, বাংলাদেশ		', '5b59ad56a2675shakil.jpg'),
(17, 'সজিব খান', 'sojib@gmail.com', '12345', '01754752876', 'জাভা', '13', '7', '1973', 'male', 'বঙ্গবন্ধু শেখ মুজিবুর রহমান হল, কুমিল্লা বিশ্ববিদ্যাল্যয় কুমিল্লা, বাংলাদেশ					', '5b59adc2a03fesojib.jpg');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `admin_info`
--
ALTER TABLE `admin_info`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `answers`
--
ALTER TABLE `answers`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `copyright_text`
--
ALTER TABLE `copyright_text`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `higher_secondary_subjects`
--
ALTER TABLE `higher_secondary_subjects`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `notification`
--
ALTER TABLE `notification`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `questions`
--
ALTER TABLE `questions`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `question_choose`
--
ALTER TABLE `question_choose`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `secondary_lesson`
--
ALTER TABLE `secondary_lesson`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `secondary_subjects`
--
ALTER TABLE `secondary_subjects`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `site_logo`
--
ALTER TABLE `site_logo`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `site_slogan`
--
ALTER TABLE `site_slogan`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `sociallink`
--
ALTER TABLE `sociallink`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `university_course_info`
--
ALTER TABLE `university_course_info`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `university_course_list`
--
ALTER TABLE `university_course_list`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `university_department`
--
ALTER TABLE `university_department`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `university_lessons`
--
ALTER TABLE `university_lessons`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `user_info`
--
ALTER TABLE `user_info`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `admin_info`
--
ALTER TABLE `admin_info`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `answers`
--
ALTER TABLE `answers`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=26;

--
-- AUTO_INCREMENT for table `copyright_text`
--
ALTER TABLE `copyright_text`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `higher_secondary_subjects`
--
ALTER TABLE `higher_secondary_subjects`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `notification`
--
ALTER TABLE `notification`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT for table `questions`
--
ALTER TABLE `questions`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=62;

--
-- AUTO_INCREMENT for table `question_choose`
--
ALTER TABLE `question_choose`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=34;

--
-- AUTO_INCREMENT for table `secondary_lesson`
--
ALTER TABLE `secondary_lesson`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `secondary_subjects`
--
ALTER TABLE `secondary_subjects`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=25;

--
-- AUTO_INCREMENT for table `site_logo`
--
ALTER TABLE `site_logo`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `site_slogan`
--
ALTER TABLE `site_slogan`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `sociallink`
--
ALTER TABLE `sociallink`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `university_course_info`
--
ALTER TABLE `university_course_info`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `university_course_list`
--
ALTER TABLE `university_course_list`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `university_department`
--
ALTER TABLE `university_department`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `university_lessons`
--
ALTER TABLE `university_lessons`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `user_info`
--
ALTER TABLE `user_info`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=18;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
